Revit 2025 API
LinkOriginFileType Enumeration
 Enum determining whether the source type of a temporary rvt link is an ifc.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum LinkOriginFileType
Public Enumeration LinkOriginFileType
public enum class LinkOriginFileType
type LinkOriginFileType
Members
Member name | Value | Description
RVT | 0 |  Default RVT, curently only support ifc.
IFC | 1 |  The original link file is an ifc file.
See Also
Reference
Autodesk.Revit.DB Namespace